<template>
  <div class="narrative">
    <div class="story">
      <span class="text">Η πρώτη ιστορία που μου εξιστόρησε ήταν για ένα ταξίδι. Είπε ότι για αυτό το ίδιο σηματοδοτούσε την έναρξη όλων των πραγμάτων. Μου αφηγήθηκε: Εδώ κάποτε απλώνονταν δάση και πεδιάδες, δύο μεγάλοι ποταμοί κατακερμάτιζαν την ξηρά και δημιουργούσαν λίμνες διαφόρων μεγεθών με γλυκό νερό. Οι ποταμοί ξεκινούσαν από τα δυτικά ο ένας και από τα ανατολικά ο άλλος. Το κλίμα ήταν ιδιαίτερα θερμό και η βλάστηση ήταν πλούσια. Υπήρχαν πανύψηλα δέντρα ανθοφόρα, κωνοφόρα και φοινικόδεντρα, ενώ μεγάλα θηλαστικά ζούσαν σε όλη την περιοχή, όπως ελέφαντες,  καμηλοπαρδάλεις αλλά και ελάφια, αντιλόπες, γαζέλες, ερπετά και πουλιά. Στις λίμνες μαζεύονταν ιπποπόταμοι, ρινόκεροι και δίκεροι.  Τις μικρές εκτάσεις με νερό τις διανύαμε κολυμπώντας. Μαζευόταν  ο πληθυσμός, έπεφτε το σύνθημα και ξεκινούσαμε. Υπήρχε μία τάξη και μία οργάνωση στις μετακινήσεις. Αλλά όχι και προσχεδιασμένος προορισμός. Αν ο πληθυσμός εντόπιζε στη διάρκεια του ταξιδιού ένα καλό σημείο σταματούσε εκεί και αυτό γινόταν ο νέος τόπος. Αυτό ακριβώς συνέβη και με εμάς. Θυμάμαι καλά την πρώτη φορά που βρεθήκαμε εδώ, έβρεχε πολύ και είχαμε μαζευτεί κοντά κοντά οι οικογένειες να προστατευτούμε από το νερό. Η βροχή πρέπει να κράτησε μέρες. Και όταν κόπασε πια και είδαμε ξανά ουρανό πάνω από τα κεφάλια μας οι γηραιότεροι ομόφωνα αποφασίσανε: αυτός θα ήταν ο τόπος μας από δω και μπρος. Ο τόπος μάς φέρθηκε καλά. Οι ντόπιοι πληθυσμοί μάς δέχτηκαν χωρίς προβλήματα. Τροφή υπήρχε για όλους και αυτό φυσικά εξασφάλιζε μία ειρηνική συμβίωση. Η βλάστηση άλλωστε ήταν πλούσια.</span>
      <span class="text">Κατά κάποιον τρόπο όλα αυτά με κάνουν να σκέφτομαι την ευθραυστότητα. Του παρόντος ή του παρελθόντος. Και πάντα του μέλλοντος. Μου αρέσει αυτή η στιγμή ευθραυστότητας που αιωρείται στο χρόνο. Προσδίδει μία άλλη υφή στα πράγματα και στις καταστάσεις.</span>
      <span class="text">Συνέχισε: Μετά από κάποιο καιρό άρχισαν οι εκρήξεις. Αν δεν το ζήσεις δεν μπορείς να καταλάβεις πως είναι. Ο ουρανός έβρεχε φωτιά. Όλα ήταν κόκκινα, μαύρα, γκρι. Άρχισε η εποχή των ηφαιστείων, και η εποχή αυτή κράτησε πολύ. Αν κοιτάξεις προσεχτικά πάνω μου θα δεις ακόμη τέφρα. Όταν τελείωσαν οι εκρήξεις όλα ήταν διαφορετικά. Καταρχήν η γη. Αυτό που γνωρίζαμε ως επικράτεια μας κατέρρευσε. Τριγύρω βλέπαμε λάβα και νερό. Και κάπου κάπου θραύσματα στεριάς. Αυτά μετά τα είπανε νησιά. Έμοιαζαν να επιπλέουν αλλά δεν επέπλεαν.  Ήταν οι απολήξεις της γης, της γης που ξέραμε εμείς ως τόπο μας.</span>
      <span class="text">Εμείς όπως και πολλοί άλλοι βγήκαμε ζωντανοί από την εποχή των εκρήξεων αλλά αναγκαστήκαμε να γίνουμε μικροί. Για να επιβιώσεις στα θραύσματα, οφείλεις να γίνεις θραύσμα και εσύ το ίδιο. Έχω ζήσει πολλά αλλά κάτι τέτοιο δεν έμελλε να ξαναζήσω ποτέ.</span>
      <span class="text">Γίναμε μικροί λοιπόν, μου είπε μετά από μία παύση. Συγκεντρώθηκε για μία στιγμή σαν να ανέτρεχε ένα μεγάλο αρχείο. Προσαρμογή είναι η λέξη είπε. Και κάπως έτσι μέσα από την προσαρμογή στη νέα θραυσματική, αποσπασματική κατάσταση γεννήθηκαν τα δίκτυα. Αυτά τα αόρατα νήματα που κρατούν τα θραύσματα μαζί, συνδεδεμένα και ενωμένα, για λόγους καθαρής επιβίωσης. Πως να χωρίσεις άλλωστε κάτι που ήταν ενωμένο; Τα δίκτυα επανεγγράφουνε τις μνήμες της προϋπάρχουσας σύνδεσης. Έμεινε σιωπηλό. Ήθελα να το αγγίξω, μα φοβόμουν ότι ήταν πολύ εύθραυστο. Βυθίστηκε στις σκέψεις του. Το σχήμα του ήταν αδιευκρίνιστο. Προσπάθησα να αναγνωρίσω τους χρωματισμούς του, μα δεν ήταν ούτε μπλε, ούτε πράσινο, ούτε γκρι. Έμοιαζαν να μεταβάλλονται διαρκώς και στιγμές στιγμές ήταν σαν να αντανακλούν την εικόνα μου άλλοτε πάλι σαν να την απορροφούν μέσα τους.</span>
      <span class="text">Έπειτα από μερικά λεπτά, σαν να βγαίνει από λήθαργο, ξαναμίλησε. Μνήμη και επιβίωση. Μετά από εμάς ή παράλληλα με εμάς αναλάβανε και άλλοι πληθυσμοί να δημιουργήσουν συνδέσεις και δίκτυα. Καταλάβαιναν όλοι αργά ή γρήγορα ότι η σύνδεση ήταν ο μοναδικός τρόπος επιβίωσης. Αν δεν ήσουν συνδεδεμένος πέθαινες. Η προϊστορία και η ιστορία αυτής της επικράτειας βασίστηκε στα δίκτυα, στην επανεγγραφή της μνήμης εκείνης της προϋπάρχουσας σύνδεσης. Αυτή καθόρισε και καθορίζει τον ευρύτερο τόπο. Η διαρκής συνομιλία. Αν κάνεις απόλυτη ησυχία, θα ακούσεις, πάντα θα ακούς μια διαρκή συνομιλία πάνω από τα κύματα.</span>
    </div>

  </div>
</template>

<script>
import Api from '../api';

export default {
  name: 'Narrative',

  data () {
    return {
      assets: []
    };
  },

  created () {
    this.fetchAssets();
  },

  methods: {
    fetchAssets: function() {
      Api.fetchAssets().then(response => {
        this.assets = response.data;
        const height = Math.max(document.body.scrollHeight, document.body.offsetHeight, document.documentElement.clientHeight, document.documentElement.scrollHeight, document.documentElement.offsetHeight);
        document.getElementById('app').style.height = height + 'px';
      // eslint-disable-next-line
      }, error => {
        this.assets = [];
      });
    }
  }
};
</script>

<style lang="scss" scoped>
.narrative {
  margin: 0 auto;

  .story {
    position: relative;

    .text {
      line-height: 22px;
      // background-color: #ff00ff;
      background-color: black;

      &:after {
        content: '';
        display: block;
        margin-bottom: 20px;
      }
    }
  }

  .asset {
    position: absolute;
    z-index: 0;
    max-height: 200px;
  }
}
</style>
